---
kind: type
id: T:Autodesk.Revit.Exceptions.ApplicationException
source: html/05012a96-16ea-ace7-6115-b45406dacead.htm
---
# Autodesk.Revit.Exceptions.ApplicationException

The exception that is thrown when a non-fatal application error occurs.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class ApplicationException : Exception
```

## Remarks
This class is the base class of all Revit specified exceptions.